poker/app/controllers/games_controller.rb

INSERT INTO "games" ("room_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["room_name", "natalia"], ["created_at", "2020-03-05 04:11:09.379839"], ["updated_at", "2020-03-05 04:11:09.379839"]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]
---
  def destroy
    @game.players.each do |p|
      p.destroy
    end

    @game.destroy