app/views/users/index.html.erb

        <td><%= user.username %></td>
        <td><%= user.players.size %> </td>
---
SELECT "players".* FROM "players" WHERE "players"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "players" WHERE "players"."user_id" = ?  [["user_id", 6]]