poker/app/views/games/show.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
hi. <br/>
<%= Card.find(1).rank %>