app/views/games/index.html.erb

SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 7]]
---
        <div class='table-data'> <%= game.room_name %></div>
        <div class='table-data'> <%= game.players.length %></div>