app/views/games/show.html.erb

SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 5]]
---
  <div class = "row">
    <% @game.players.each do |player| %>