app/views/games/show.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
hi. <br/>
<%= Card.find(1).rank %>
<%= Card.find(1).suit %>

SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 5]]
---
Players: <br/>
<% @game.players.each do |player| %>

SELECT "cards".* FROM "cards" WHERE "cards"."game_id" = ?  [["game_id", 5]]
---
Cards: <br/>
<% @game.cards.each do |card| %>