app/controllers/games_controller.rb

  def create
    @game = Game.create(game_params)
    @game.init
    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("room_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["room_name", "viper"], ["created_at", "2020-02-23 21:48:42.308604"], ["updated_at", "2020-02-23 21:48:42.308604"]]
INSERT INTO "games" ("room_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["room_name", "briuh"], ["created_at", "2020-02-29 01:10:34.946547"], ["updated_at", "2020-02-29 01:10:34.946547"]]

  def update
    respond_to do |format|
      if @game.update(game_params)
---
UPDATE "games" SET "room_name" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["room_name", "viper_2"], ["updated_at", "2020-02-23 21:49:07.915818"], ["id", 1]]

  def destroy
    @game.players.each do |p|
      p.destroy
    end

    @game.destroy
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 3]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 11]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 3]]

  def add_ai
    Game.find_by(id: params[:game]).add_ai_player(params[:type], User.find_by(id: params[:user].to_i))
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 16]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def add_player
    Game.find_by(id: params[:game]).add_user_player(User.find_by(id: params[:user].to_i))
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def move_card
    Game.find(params[:game]).move_card(Card.find(params[:card]), params[:destination])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def deal
    Game.find_by(id: params[:game]).deal(params[:round])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def set_round
    Game.find_by(id: params[:game]).set_round(params[:round])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]