app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "asd"], ["password", "asd"], ["created_at", "2020-02-28 02:50:46.824747"], ["updated_at", "2020-02-28 02:50:46.824747"]]
INSERT INTO "users" ("username", "password", "player", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "andrew"], ["password", "hello"], ["player", "idk"], ["created_at", "2020-02-28 02:39:19.128329"], ["updated_at", "2020-02-28 02:39:19.128329"]]
---
  def create
    @user = User.create(user_params)
    session[:user_id] = @user.id
    respond_to do |format|
      if @user.save

SELECT "players".* FROM "players" WHERE "players"."user_id" = ?  [["user_id", 2]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @user.players.each do |p|
      p.destroy
    end
    @user.destroy