app/models/game.rb

  def init
    self.round = 4
    ranks = ['A', '2', '3', '4', '5', '6', '7', '8', '9', '10', 'J', 'Q', 'K']
    suits = ['S', 'H', 'C', 'D']
    self.pot = 0
    self.dealer = 10
    self.big_blind = 2
    self.small_blind = 1
    self.high_bet = -1
    self.high_better = -1
    ranks.collect do |rank|
      suits.collect do |suit|
        self.cards << Card.new({:game_id => self.id, :rank => rank, :suit => suit, :location => -1})
---
INSERT INTO "cards" ("game_id", "suit", "rank", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["game_id", 8], ["suit", "S"], ["rank", "A"], ["location", "deck"], ["created_at", "2020-03-07 06:18:57.979011"], ["updated_at", "2020-03-07 06:18:57.979011"]]
INSERT INTO "games" ("room_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["room_name", "veer2"], ["created_at", "2020-03-07 06:18:57.954051"], ["updated_at", "2020-03-07 06:18:57.954051"]]

  def deal(round)
    round_int = round.to_i
    case round_int
    when 0
      self.players.each do |player|
        move_card(get_random_card, player.location)   # moves cards to users
        move_card(get_random_card, player.location)
        # player.in_hand = true
        player.save
---
INSERT INTO "players" ("game_id", "user_id", "ai", "username", "location", "money", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)